import ParagraphBox from "@/components/LearningManagementSystem/LessonContent/ParagraphBox";
import { Box, Heading, Text } from "@chakra-ui/react";

function Lesson1_1() {

  const introductionText = [
    "ברוכים הבאים לעולם התכנות ופיתוח אתרי אינטרנט. בקורס שלפנינו נכיר מושגים בסיסיים מעולם התכנות והפיתוח. נלמד איך אתר אינטרנט בנוי, נכיר מקרוב סוגים שונים של אתרי אינטרנט וננסה לזהות דפוסים חוזרים שבהם משתמשים באתרי אינטרנט מוכרים ופחות מוכרים.",
    "אבל החלק העיקרי והטוב של בקורס הזה הוא היצירה העצמאית. אנחנו נלמד את שפת הפיתוח הפופולרית שבעזרתה כל אתרי האינטרנט בעולם כתובים - שפת HTML. נכיר את כל המרכיבים הבסיסיים שעוזרים לנו לבנות דף אינטרנט עם רכיבים שונים כמו כותרות, טקסטים, תמונות, קישורים ועוד רכיבים רבים וטובים.",
    "נכיר גם את שפת העיצוב של אתרי אינטרנט - CSS - שבעזרתה נוכל לטפל בפן החזותי של האתר, ולדאוג שהאתר שלנו יהיה קריא, נעים לעין ונגיש לכל משתמש שמבקר באתר שלנו. נלמד גם מה החשיבות של עיצוב נכון לאתר ואיך הוא משפיע על חווית המשתמש.",
    "רגע לפני הסוף נלמד את היסודות של שפת התכנות הפופולרית Java Script, שלמעשה באמצעותה נוכל לחבר את כל מה שנבנה ב-HTML עם מה שנעצב ב-CSS, ונוסיף את הנשמה והחַיוּת לאתר שלנו. במילים אחרות, בשלב זה נוסיף לכל הרכיבים שנשתמש בהם פונקציונליות ונביא אותם לתפקוד פעיל, מודולורי ואפילו נדאג לרכיבים שונים בדף האינטרנט שנבנה לתקשר זה עם זה ולבצע פעולות שונות.",
    "חלק האחרון של הקורס מוקדש לביצוע פרויקט סיום שבמסגרתו כל תלמיד יעבוד על אתר אישי שהוא יבנה מהצעדים הראשונים ועד העלאה שלו לאינטרנט וחשיפת האתר לכל החפץ בו."
  ]

  return (
    <Box my={10}>
      <Heading
        as="h2"
        style={{ fontFamily: "Varela Round, sans-serif" }}
        fontSize={24}
        pb={8}
        tabIndex={4}
      >
        מה נלמד בקורס?
      </Heading>
      <ParagraphBox textContent={introductionText} />
    </Box>
  );
}

export default Lesson1_1;


/**
 * "ברוכים הבאים לעולם התכנות ופיתוח אתרי אינטרנט. בקורס שלפנינו נכיר מושגים בסיסיים מעולם התכנות והפיתוח. נלמד איך אתר אינטרנט בנוי, נכיר מקרוב סוגים שונים של אתרי אינטרנט וננסה לזהות דפוסים חוזרים שבהם משתמשים באתרי אינטרנט מוכרים ופחות מוכרים."
 */