{
  "text1": [
    "HTML ,ראשי תיבות של HyperText Markup Language, זו למעשה שפת תגיות שעל בסיסה כל אתרי האינטרנט בנויים. מסמך HTML קובע את המשמעויות של התכנים שקיימים בעמוד האינטרנט, ואת המבנה של תוכן העמוד. משמעות המונח HyperText בראשי התיבות מתייחסת לקשרים שבין דפי אינטרנט שונים, או אפילו אתרי אינטרנט שונים שמקושרים אחד לשני. כלומר ברגע שאנחנו מעלים תוכן ויוצרים דף אינטרנט, אנחנו הופכים באותו רגע למשתתפים פעילים ב-World Wide Web - רשת האינטרנט הגדולה.",
    "המונח Markup שבראשי התיבות מתייחס לתגיות שמגדירות כל סוג של תוכן שמופיע בעמוד האינטרנט למשל תכנים מילוליים מוגדרים על-ידי תגיות מסוימות, תכנים חזותיים מוגדרים על-ידי תגיות אחרות. ויש גם תגיות שמגדירות אזורים מסויימים בתוך העמוד בעלי מאפיינים שונים ויחודיים. כמו כן, יש תגיות שבהגדרה שלהן מתייחסות לתוכן שמוצג בדפדפן, ותגיות אחרות שמציינות פרטים טכניים על האתר ונשארות מאחורי הקלעים. בפרק הזה של הקורס אנחנו נלמד על כל התגיות הבסיסיות ועל התפקידים היחודיים של כל אחת.",
    "ראשית, נתחיל מהיכרות עם המבנה הבסיסי ביותר שכל מסמך HTML מתחיל ממנו."
  ],
  "code": [
    { "element": "<!DOCTYPE html>", "spaces": 0, "color": "yellow.300" },
    { "element": "<html>", "spaces": 0, "color": "red.300" },
    { "element": "<head>", "spaces": 2, "color": "blue.300" },
    { "element": "<meta charset=\"UTF-8\" />", "spaces": 4, "color": "white" },
    {
      "element": "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />",
      "spaces": 4,
      "color": "white"
    },
    { "element": "<title>Document</title>", "spaces": 4, "color": "white" },
    { "element": "<style></style>", "spaces": 4, "color": "white" },
    { "element": "</head>", "spaces": 2, "color": "blue.300" },
    { "element": "<body>", "spaces": 2, "color": "green.300" },
    { "element": "", "spaces": 2, "color": "white" },
    { "element": "</body>", "spaces": 2, "color": "green.300" },
    { "element": "</html>", "spaces": 0, "color": "red.300" }
  ],
  "text2": [
    "תגית מוגדרת על סוגריים משולשים ובינהן שם התגית. כמו כן, לרוב התגיות תהיה תגית פותחת ותגית סוגרת. כדי להגדיר מסמך כמסמך אינטרנט, התגיות הראשונות שאנחנו חייבים לציין הן תגיות <html> כתגית פותחת בתחילת המסמך, ותגית <html/> כתגית סוגרת בסוף המסמך.",
    "כמו כן, בנוסף לצמד התגיות האלה, כל מסמך HTML חייב גם להיות מצוין בראש המסמך התגית <DOCTYPE html!> כדי לציין לדפדפן כי המסמך הוא מסוג HTML ויש להתייחס ולפענח אותו בהתאם.",
    "בין שתי התגיות האלה, אנחנו נמצא תמיד עוד שני צמדי תגיות:"
  ],

  "ulText": [
    "<head></head>",
    "<body></body>"
  ],
  "text3": [
    "בין צמד התגיות האלה יופיעו כל הפרטים הלא חזותיים של מסמך ה-HTML. כלומר כל אותם פרטים שהדפדפנים משתמשים בהם כדי להבין את סוג העמוד ותכניו. לדוגמא, בתגי <meta /> יצויינו פרטים כמו שיטת קידוד המלל, תצוגת אופטימלית של האתר, ולמעשה כל מידע אודות האתר.",
    "בין תגים אלה אנחנו גם תמיד נמצא את צמד תגי <title></title> שמציינים את כותרת העמוד, אשר תופיע בכותרת חלון הדפדפן של העמוד המסוים.",
    "בנוסף לאלה אנחנו יכולים למצוא בין תגי הראש של המסמך עוד תגיות נוספות שהן האחריות על עיצוב העמוד."
  ],
  "text4": [
    "בין צמד התגיות האלה נמצא את הרכיבים החזותיים שמוצגים בעמוד בדפדפן האינטרנט. כלומר על קטעי המלל, תמונות, גרפים, טפסים, קישורים וכפתורים ועוד רכיבים רבים שאנחנו בוחרים להציב בתוך העמוד שאנחנו בונים."
  ]
}


