{
  "text_intro1": [
    "בשיעור הקודם עסקנו בסוגים השונים של מלל, ואפילו יצרנו עמוד אינטרנט פשוט שחידשנו בו כתבה מהעבר. אבל האינטרנט מאפשר לנו הרבה יותר מזה. בשונה מהעיתונות המודפסת, באתר אינטרנט אנחנו יכולים לחבר ביתר קלות בין רעיונות שונים, מקורות מידע, דפים ואפילו אנשים.",
    "אז רגע לפני שנצלול לעומק השיעור, בואו נשחק משחק קטן עם קישורים, ונבדוק אילו חיבורים אנחנו יכולים לעשות במרחב האינטרנט."
  ],
  "game": [
    "מטרת המשחק להגיע מערך אחד לאחר בדרך הקצרה ביותר.",
    "איך משחקים? מתחילים מערך אחד  שקובעים מראש, מגדירים ערך יעד שאליו רוצים להגיע בסוף, ומתחילים לחפש דרך הקישורים שמופיעים בכל ערך את הדרך לערך היעד שהוגדר מראש.",
    "המנצח הוא זה שהגיע לערך היעד בדרך הכי קצרה (עם הכי פחות הקלקות).",
    "ערכים שאפשר לבחור: תל-אביב - מדריד, נועה קירל - דוד בן גוריון, ליונל מסי - ערן זהבי ועוד כיד הדמיון הטובה."
  ],
  "text_intro2": [
    "אנחנו יכולים לקשר בין אזורים שונים בתוך העמוד שבו אנחנו צופים, לקשר בין עמודים שונים באתר שלנו, ואפילו לקשר בין אתרים שונים לחלוטין. למעשה, אם נחזור לדוגמא של העיתון, היכולת לקשר בין אלמנטים שונים, הופכת את האינטרנט למרחב ענק של ידע,עם אפשרויות כמעט בלתי מוגבלות.",
    "אז איך מוסיפים קישורים למסמך HTML שאנחנו בונים? פשוט מאוד, כמו לכל רכיב, גם לקישור יש תגיות משלו."
  ],
  "code1": [{ "element": "<a>HyperLink</a>", "spaces": 0, "color": "white" }],
  "text_intro3": [
    "אבל התגיות האלה לא מספיקות עדיין כדי שהקישור באמת יעבוד, אנחנו צריכים להגדיר בדיוק מה אנחנו רוצים שהקישור הייחודי הזה יעשה. מה הכוונה \"ייחודי\"? הכוונה היא שגם אם אנחנו רוצים להשתמש בכמה קישורים באתר שלנו, אנחנו לא רוצים שכל הקישורים יקשרו בדיוק לאותו יעד. לכל קישור יש את התפקיד שלו - או במילים אחרות, לכל קישור יש התכונות (Attributes) שלו.",
    "אז אילו תכונות יכולות להיות לקישור? בראש ובראשונה - יעד. הכי חשוב, לאן אנחנו רוצים שהקישור ינווט. קישור יכול לנווט למגוון של יעדים. כאמור, לדפי אינטרנט אחרים או לחלק אחר באותו עמוד, אבל קישור יכול גם לנווט להורדת קובץ, לשליחת דואר אלקטרוני, למספר טלפון ולעוד סוגים שונים של יעדים.",
    "אז כדי להגדיר לקישור את תכונת היעד אנחנו נוסיף בתוך התגית הפותחת את התכונה href, שזה למעשה קיצור של hyperlink reference, באופן הבא:"
  ],
  "code2": [
    {
      "element": "<a href=\"https://www.google.com\">Go to Google</a>",
      "spaces": 0,
      "color": "white"
    }
  ],
  "output2": [
    {
      "type": "a",
      "content": "Go to Google",
      "style": {
        "color": "blue",
        "textDecoration": "underline",
        "cursor": "pointer"
      }
    }
  ],
  "text_attributes": [
    "תכונה (Attribute) נוספת שחשוב להכיר כשמגדירים קישור היא אופן הפעולה של הניווט. כלומר האם הקישור יפתח באותו חלון, בחלון חדש, בלשונית (tab) חדשה, או במסגרת מוגדרת בתוך העמוד הנצפה.",
    "את התכונה הזאת אנחנו מגדירים באמצעות התכונה target שיכולה לקבל מספר ערכים, כשהשימושיים בינהם הם אלה:"
  ],
  "textList1": [
    "\"self_\"  - ערך ברירת המחדל של קישור. משמעותו היא שהקישור נפתח באותו עמוד שהוא הקישור נמצא. בתכונה הזאת אנחנו בדרך כלל נשתמש עבור קישורים פנימיים בתוך האתר שלנו. למשל לעמוד אחר באתר שלו או לחלק אחר בתוך העמוד. כמו כן, מכיוון שזו התנהגות ברירת המחדל של קישור, אנחנו לא חייבים להוסיף אותה.",
    "\"blank_\" - הערך הזה יגרום לקישור להיפתח בחלון חדש או בלשונית (tab) חדשה של הדפדפן. באפשרות זו אנחנו נעדיף להשתמש עבור קישורים חיצוניים, כלומר קישורים שמנווטים מחוץ לאתר שלנו, לאתרים אחרים. "
  ],
  "code3": [
    {
      "element": "<a href=\"https://www.google.com\" target=\"_blank\">Go to Google</a>",
      "spaces": 0,
      "color": "white"
    },
    {
      "element": "<a href=\"https://www.my-site.com\" target=\"_self\">About me</a>",
      "spaces": 0,
      "color": "white"
    }
  ],
  "output3": [
    {
      "type": "a",
      "content": "Go to Google",
      "style": {
        "href": "https://google.com",
        "target": "_blank",
        "color": "blue",
        "textDecoration": "underline",
        "cursor": "pointer"
      }
    },
    {
      "type": "a",
      "content": "About me",
      "style": {
        "href": "https://mysite.com",
        "target": "_self",
        "color": "blue",
        "textDecoration": "underline",
        "cursor": "pointer"
      }
    }
  ],
  "text_relations": [
    "אם פתחתם את תצוגת הפלט של דוגמת הקוד האחרונה כאן, יכולתם בוודאי לראות ששני הקישורים שהוספנו התמקמו באותה שורה, בזה אחר זה. ההתנהגות הזו שונה מכפי שראינו בשיעור הקודם כשלמדנו על כותרות, פסקאות ורשימות. ההבדל הוא במאפיינים השונים של כל אחד מהרכיבים הללו. ישנם רכיבים שכברירת מחדל תופסים את כל רוחב הדף, מה שנקרא block (גם אם התוכן לא), ואז רכיבים אחרים שבאים אחריהם יתמקמו שורה אחת מתחתיהם. וישנם רכיבים שמתמקמים בתוך השורה, מה שנקרא inline, כלומר הם ישתלבו בתוך שורה, במידת האפשר.",
    "משום כך, ברכיבי inline אנחנו יכולים להשתמש גם בצורה עצמאית במרחב הדף, וגם בתוך רכיבים אחרים. לדוגמא לשלב קישור בתוך פסקה, רשימה, כותרת או כל רכיב אחר."
  ],
  "code4": [
    {
      "element": "<p>",
      "spaces": 0,
      "color": "white"
    },
    {
      "element": "אספת עם גדולה שהשתתפו בה ארבעים אלף יהודים, קבלה החלטה הדורשת מאת ",
      "spaces": 2,
      "color": "white"
    },
    {
      "element": "<a href=\"https://www.my-site.com\">בריטניה,</a>",
      "spaces": 2,
      "color": "white"
    },
    {
      "element": " כי עליה להצהיר מחדש את רצונה להגשים את הצהרת בלפור.",
      "spaces": 2,
      "color": "white"
    },
    {
      "element": "</p>",
      "spaces": 0,
      "color": "white"
    }
  ],
  "output4": [
    {
      "type": "p",
      "content": [
        {
          "type": "span",
          "content": "אספת עם גדולה שהשתתפו בה ארבעים אלף יהודים, קבלה החלטה הדורשת מאת ",
          "style": {}
        },
        {
          "type": "a",
          "content": "בריטניה,",
          "style": {
            "color": "blue",
            "href": "#",
            "textDecoration": "underline",
            "cursor": "pointer"
          }
        },
        {
          "type": "span",
          "content": " כי עליה להצהיר מחדש את רצונה להגשים את הצהרת בלפור.",
          "style": {}
        }
      ],
      "style": {
        "display": "block",
        "marginTop": "1em",
        "marginBottom": "1em",
        "marginLeft": "0",
        "marginRight": "0"
      }
    }
  ],
  "text_conclusion1": [
    "לסיכום, הכרנו בשיעור הזה את אחת התגיות הכי חשובות ושימושיות בתהליך בניית אתר. אפשר לומר שבלי קישורים האתר יהיה דומה יותר לספר, או לעיתון. הקישורים מאפשרים לנו לנווט בקלות במרחב העמוד, האתר והאינטרנט בכלל",
    "התרגיל של השיעור הזה יהיה המשך ישיר לתרגיל הקודם. הוסיפו למאמר שבחרתם ויצרתם ממנו עותק דיגטלי קישורים בתוך הטקסט, והפכו את הכתבה שהשתמשתם לקטע בסגנון ויקיפדיה. כלומר ביחרו מילים מסוימות וקשרו בעזרתן את הטקסט שלכם למקורות נוספים ברחבי האינטרנט. ",
    "לדוגמא, אם בחרתם בטקסט כמו זה:"
  ],
  "text_frame": [
    "צ'רצ'יל אמר באספה אחת שנערכה בוואנקובר, קנדה, שאין כל גורם שיפריע ליהודים והערבים לחיות זה על יד זה. היהודים הביאו לא\"י עושר רב ותרבות, אף מפלגה  בריטית לא תסתלק מן ההתחייבויות כלפי התנועה הציונית בימי המלחמה."
  ],
  "text_conclusion2": [
    "אתם יכולים להפוך את המילה \"צ'ר'צ'יל\" לקישור ולשלוח את המשתמש לעמוד בויקיפדיה שמפרט מי הוא היה. או לבחור את המילה \"קנדה\" ולקשר אותה למקור מידע קשור כפי ראות עיניכם. אפשר גם כמובן להפוך כמה מילים ביחד לקישור אחד.",
    "מתוך הכתבה שברשותכם צרו לפחות 7 קישורים."
  ]
}
