{
  "text1": [
    "HTML ,ראשי תיבות של HyperText Markup Language, זו למעשה שפת תגיות שעל בסיסה כל אתרי האינטרנט בנויים. מסמך HTML קובע את המבנה של עמוד אינטרנט ואת המשמעויות של התכנים והרכיבים שנמצאים בעמוד האינטרנט. משמעות המונח HyperText בראשי התיבות מתייחסת לקשרים שבין דפי אינטרנט שונים, ובכלל זאת גם בין אתרי אינטרנט. כלומר ברגע שאנחנו מעלים תוכן ויוצרים דף אינטרנט, אנחנו הופכים באותו רגע למשתתפים פעילים ב-World Wide Web - רשת האינטרנט הגדולה.",
    "המונח Markup שבראשי התיבות מתייחס לתגיות שמגדירות כל סוג של תוכן שמופיע בעמוד האינטרנט למשל תכנים מילוליים מוגדרים על-ידי תגיות מסוימות, תכנים חזותיים מוגדרים על-ידי תגיות אחרות. ויש גם תגיות שמגדירות אזורים מסויימים בתוך העמוד בעלי מאפיינים שונים ויחודיים. כמו כן, יש תגיות שבהגדרה שלהן מתייחסות לתוכן שמוצג בדפדפן, ותגיות אחרות שמציינות פרטים טכניים על האתר ונשארות מאחורי הקלעים. בפרק הזה של הקורס אנחנו נלמד על כל התגיות הבסיסיות ועל התפקידים היחודיים של כל אחת.",
    "כל רכיב שאנחנו רוצים לשים בעמוד אינטרנט שאנחנו יוצרים צריך להיות תחום בין תגית פתיחה לתגית סגירה. לדוגמא, אם אנחנו רוצים להוסיף את המשפט \"כי האדם עץ השדה\" אנחנו נעטוף את המשפט הזה בתג פסקה פותח ובתג פסקה סוגר."
  ],
  "code1" : [
    { "element": "<p>כי האדם עץ השדה</p>", "spaces": 0, "color": "white" }
  ],
  "text_anatomy": ["לכל עמוד אינטרנט יש מבנה בסיסי אחיד וקבוע. ראשית כל, המסמך תחום כולו בתגי <html> אשר בין התג הפותח לתג הסוגר אנחנו נכתוב את כל הקוד של העמוד. בין התגים האלה יופיעו תמיד עוד שני סוגים של תגים - תג <head> ותג <body>."],
  "code2": [
    { "element": "<!DOCTYPE html>", "spaces": 0, "color": "yellow.300" },
    { "element": "<html>", "spaces": 0, "color": "red.300" },
    { "element": "<head>", "spaces": 2, "color": "blue.300" },
    { "element": "<meta charset=\"UTF-8\" />", "spaces": 4, "color": "white" },
    {
      "element": "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />",
      "spaces": 4,
      "color": "white"
    },
    { "element": "<title>Document</title>", "spaces": 4, "color": "white" },
    { "element": "<style></style>", "spaces": 4, "color": "white" },
    { "element": "</head>", "spaces": 2, "color": "blue.300" },
    { "element": "<body>", "spaces": 2, "color": "green.300" },
    { "element": "", "spaces": 2, "color": "white" },
    { "element": "</body>", "spaces": 2, "color": "green.300" },
    { "element": "</html>", "spaces": 0, "color": "red.300" }
  ],
  "text_html": [
    "כדי להגדיר מסמך כמסמך אינטרנט, התגיות הראשונות שאנחנו חייבים לציין הן תגיות <html> כתגית פותחת בתחילת המסמך, ותגית <html/> כתגית סוגרת בסוף המסמך. התגיות האלה מגדירות את המסמך הממשי, ובינהן יבוא כל התוכן של העמוד.",
    "כמו כן, בנוסף לצמד התגיות האלה, בכל מסמך HTML חייב גם להיות ציון בראש המסמך על-ידי התגית <DOCTYPE html!> אשר מציינת את גרסת ה-HTML שבה נעשה שימוש במסמך. בגרסת HTML5 משתמשים בתגית זו. בהמשך הקורס נלמד יותר לעומק על השינוי שגרסת HTML5 הביאה לעולם פיתוח האתרים, ועל היתרונות הרבים שלה."
  ],
  "text_head": [
    "בין צמד התגיות האלה יופיעו כל הפרטים על דף האינטרנט אשר לא אינם מוצגים על המסך. כלומר כל אותם פרטים שהדפדפנים משתמשים בהם כדי להבין את סוג העמוד והתוכן שבו. לדוגמא, פרטים כמו שיטת קידוד המלל, תצוגת מסך אופטימלית של האתר, עיצוב וסגנון ועוד דברים שנלמד בהמשך הקורס..",
    "בין תגים אלה אנחנו גם תמיד נמצא את צמד תגי <title></title> שמציינים את כותרת העמוד, אשר תופיע בכותרת חלון הדפדפן של אותו עמוד."
  ],
  "text_body": [
    "בין צמד התגיות האלה נמצא את הרכיבים החזותיים שמוצגים בעמוד בדפדפן האינטרנט. כלומר על קטעי המלל, תמונות, גרפים, טפסים, קישורים וכפתורים ועוד רכיבים רבים שאנחנו בוחרים להציב בתוך העמוד שאנחנו בונים."
  ]
}