{
  "text_intro1": [
    "מילים מהוות חלק עיקרי ומשמעותי מאוד בכל אתר אינטרנט. אבל אם כל התוכן המילולי יהיה אחיד וזהה חווית המשתמש עלולה להיפגע מאוד, ואף ההתמצאות באתר עלולה להפוך למשימה מסורבלת ומעיקה. ",
    "עוד הרבה לפני שהאינטרנט נכנס לחיינו, ואיתו המדיה הדיגיטלית, התקשורת התבססה בעיקר על עיתונים מודפסים. בעיתון \"דבר\", מספטמבר 1929, שמובא כאן כדוגמא אנחנו יכולים לראות את ההבדלים הטקסטואליים. אנחנו יכולים לראות שישנן כותרות, פסקאות, הערות שוליים וקרדיטים. סוגי הטקסטים השונים נבדלים זה מזה במאפיינים שונים, בעיקר בגודל האותיות, והם למעשה מה שעוזר לקורא להתמצא בצורה טובה יותר בעיתון, להבין איפה מתחילה כתבה, והיכן היא מסתיימת, לזהות את נושא הכתבה ולהחליט אם היא מספיק מעניינת אותו כדי להמשיך לקרוא."
  ],
  "text_intro2": [
    "באותו אופן גם המדיה הדיגיטלית עובדת. גם כשאנחנו מתכננים עמוד אינטרנט, אנחנו נדאג שיהיו בו כותרות, חלוקה לפסקאות, הערות שוליים אם צריך, קרדיטים וכיוצא באלה. אם אנחנו עובדים עם טקסט ארוך כמו פרסום בבלוג, פוסט או כתבה, אז גם נדאג לעשות ריווח בין השורות ובין הפסקאות. הכל על מנת לאפשר נוחות מירבית למשתמשים באתר שלנו.",
    "כמו שכבר למדנו בשיעור הקודם במבנה הבסיסי של מסמך HTML, טקסטים הם רכיב שאנחנו רוצים להציג למשתמש. לכן כל התגיות האלה יתווספו בין תגי ה-<body>. "
  ],
  "text_headings": [
    "עומדות לרשותנו שישה סוגי כותרות שאנחנו יכולים להשתמש בהן בתוך המסמך. התג שמגדיר כותרת מכיל את האות \"h\" וספרה בין 1 ל-6. כאשר <h1> היא כותרת ראשית, והכותרות הבאות הן תתי-כותרות ברמה חשיבות שהולכת וקטנה.",
    "הרמות השונות של הכותרות לא רק נבדלות בגודל של הטקסט, אלא יש להן גם משמעות סמנטית. כאשר הדפדפן קורא את מסמך ה-HTML כדי להציגו על המסך הוא יודע לזהות את סוגי הכותרות האלה. גם מנועי החיפוש משתמשים בסמנטיקה של הכותרות כדי להבין את תוכן האתר ולהציג תוצאות רלוונטיות. וחשוב באותה מידה, גם קוראי מסך (Screen Reader) שאנשים עם עיוורים ולקויי ראייה משתמשים בהם מתייחסים לסמנטיקה של הכותרות כדי לנווט בעמוד בצורה יעילה וברורה.",
    "כדי לנצל את היכולות של מנועי החיפוש, וגם כדי לא לבלבל את קוראי המסך (Screen Readers) נהוג להשתמש פעם אחת בלבד בכל עמוד בכותרת הראשית <h1>. בדרך כלל נשתמש בה עבור כותרת האתר כולו. חשוב גם לשמור על שימוש בכותרות לפי סדר המספרים, בלי לדלג על דרגות. כלומר אם לא השתמשנו בעמוד בכותרת <h3>, אז לא נשתמש בכותרת <h4>."
  ],
  "code_h": [
    { "element": "<body>", "spaces": 0, "color": "white" },
    { "element": "<h1>Main heading</h1>", "spaces": 2, "color": "yellow.300" },
    { "element": "<h2>Subheading</h2>", "spaces": 2, "color": "yellow.300" },
    {
      "element": "<h3>Sub-subheading</h3>",
      "spaces": 2,
      "color": "yellow.300"
    },
    { "element": "<h4>Header 4</h4>", "spaces": 2, "color": "yellow.300" },
    { "element": "<h5>Header 5</h5>", "spaces": 2, "color": "yellow.300" },
    { "element": "<h6>Header 6</h6>", "spaces": 2, "color": "yellow.300" },
    { "element": "</body>", "spaces": 0, "color": "white" }
  ],
  "text_paragraph": [""],
  "code_p": [
    { "element": "<body>", "spaces": 0, "color": "white" },
    { "element": "<p>Paragraph</p>", "spaces": 2, "color": "yellow.300" },
    { "element": "</body>", "spaces": 0, "color": "white" }
  ],
  "text_list": [""],
  "code_ul": [
    { "element": "<body>", "spaces": 0, "color": "white" },
    { "element": "<ul>", "spaces": 2, "color": "red.300" },
    {
      "element": "<li>Unordered list item</li>",
      "spaces": 4,
      "color": "yellow.300"
    },
    {
      "element": "<li>Unordered list item</li>",
      "spaces": 4,
      "color": "yellow.300"
    },
    {
      "element": "<li>Unordered list item</li>",
      "spaces": 4,
      "color": "yellow.300"
    },
    { "element": "</ul>", "spaces": 2, "color": "red.300" },
    { "element": "</body>", "spaces": 0, "color": "white" }
  ],
  "code_ol": [
    { "element": "<body>", "spaces": 0, "color": "white" },
    { "element": "<ol>", "spaces": 2, "color": "red.300" },
    {
      "element": "<li>Ordered list item</li>",
      "spaces": 4,
      "color": "yellow.300"
    },
    {
      "element": "<li>Ordered list item</li>",
      "spaces": 4,
      "color": "yellow.300"
    },
    {
      "element": "<li>Ordered list item</li>",
      "spaces": 4,
      "color": "yellow.300"
    },
    { "element": "</ol>", "spaces": 2, "color": "red.300" },
    { "element": "</body>", "spaces": 0, "color": "white" }
  ]
}
