[
  {
    "module": 1,
    "title": "הקדמה",
    "lessons": [
      {
        "id": 1,
        "title": "אודות הקורס",
        "content": "תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור "
      },
      {
        "id": 2,
        "title": "מה זה אינטרנט?",
        "content": "תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור "
      }
    ]
  },
  {
    "module": 2,
    "title": "HTML",
    "lessons": [
      {
        "id": 1,
        "title": "מה זה HTML, ומה החשיבות שלו בבניית אתרי אינטרנט?",
        "content": "תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור "
      },
      {
        "id": 2,
        "title": "מבנה עמוד HTML בסיסי.",
        "content": "תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור "
      }
    ]
  },
  {
    "module": 3,
    "title": "CSS",
    "lessons": [
      {
        "id": 1,
        "title": "מה זה CSS, ועל מה הוא אחראי בבניית אתרי אינטרנט?",
        "content": "תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור "
      },
      {
        "id": 2,
        "title": "הגדרות כלליות של CSS.",
        "content": "תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור "
      },
      {
        "id": 3,
        "title": "מאפייני עיצוב בסיסיים",
        "content": "תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור תוכן השיעור "
      }
    ]
  }
]
