{
  "_id": "",
  "courseId": "time-journey-through-web-developmental",
  "courseName": "מסע בזמן דרך פיתוח אתרי אינטרנט",
  "courseDescription": "קורס הבסיס לפיתוח אתרי אינטרנט בעזרת שפת HTML, עיצוב אתרים בעזרת CSS, ופיתוח פונקציונלי בעזרת שפת Java Script הפופולרית. את הקורס מלווים תרגולים רבים לחומר התאורתי בהשראת ההיסטוריה של מדינת ישראל.",
  "courseContent": [
    {
      "module": 1,
      "title": "הקדמה",
      "lessons": [
        {
          "lessonId": "1.1",
          "title": "אודות הקורס",
          "sections": [
            {
              "sectionTitle": "מה נלמד בקורס?",
              "textBlock": [
                "ברוכים הבאים לעולם התכנות ופיתוח אתרי אינטרנט. בקורס שלפנינו נכיר מושגים בסיסיים מעולם התכנות והפיתוח. נלמד איך אתר אינטרנט בנוי, נכיר מקרוב סוגים שונים של אתרי אינטרנט וננסה לזהות דפוסים חוזרים שבהם משתמשים באתרי אינטרנט מוכרים ופחות מוכרים.",
                "אבל החלק העיקרי והטוב של בקורס הזה הוא היצירה העצמאית. אנחנו נלמד את שפת הפיתוח הפופולרית שבעזרתה כל אתרי האינטרנט בעולם כתובים - שפת HTML. נכיר את כל המרכיבים הבסיסיים שעוזרים לנו לבנות דף אינטרנט עם רכיבים שונים כמו כותרות, טקסטים, תמונות, קישורים ועוד רכיבים רבים וטובים.",
                "נכיר גם את שפת העיצוב של אתרי אינטרנט - CSS - שבעזרתה נוכל לטפל בפן החזותי של האתר, ולדאוג שהאתר שלנו יהיה קריא, נעים לעין ונגיש לכל משתמש שמבקר באתר שלנו. נלמד גם מה החשיבות של עיצוב נכון לאתר ואיך הוא משפיע על חווית המשתמש.",
                "רגע לפני הסוף נלמד את היסודות של שפת התכנות הפופולרית Java Script, שלמעשה באמצעותה נוכל לחבר את כל מה שנבנה ב-HTML עם מה שנעצב ב-CSS, ונוסיף את הנשמה והחַיוּת לאתר שלנו. במילים אחרות, בשלב זה נוסיף לכל הרכיבים שנשתמש בהם פונקציונליות ונביא אותם לתפקוד פעיל, מודולורי ואפילו נדאג לרכיבים שונים בדף האינטרנט שנבנה לתקשר זה עם זה ולבצע פעולות שונות.",
                "חלק האחרון של הקורס מוקדש לביצוע פרויקט סיום שבמסגרתו כל תלמיד יעבוד על אתר אישי שהוא יבנה מהצעדים הראשונים ועד העלאה שלו לאינטרנט וחשיפת האתר לכל החפץ בו."
              ]
            }
          ]
        },
        {
          "lessonId": "1.2",
          "title": "מה זה אינטרנט?",
          "sections": [{ "sectionTitle": "אינטרנט?" }]
        },
        {
          "lessonId": "1.3",
          "title": "עורכי קוד (Text Editors)",
          "sections": [
            {
              "sectionTitle": "סביבות עבודה ועורכי קוד",
              "textBlock": [
                "בשיעורים הקודמים למדנו לבנות עמוד אינטרנט, ואפילו הצגנו אותו בדפדפן (Browser) של מערכת ההפעלה שלנו. כתבנו את הקוד ויצרנו כתבה דיגיטלית בעזרת תוכנת עיבוד תמלילים הבסיסית שמסופקת עם מערכת ההפעלה Windows - קובץ txt. של Notepad. אבל כשכותבים קוד יש סביבות עבודה אחרות נוחות יותר לשימוש וידידותיות הרבה יותר. בשיעור הקרוב נכיר את סביבת העבודה Virtual Studio Code, שאיתה אנחנו נעבוד לאורך כל הקורס הזה."
              ]
            },
            {
              "sectionTitle": "Virtual Studio Code",
              "textBlock": [
                "Virtual Studio Code, או בשמה המקוצר - VS-Code, היא תוכנת עריכת קוד שפותחה על-ידי חברת Microsoft נפוצה מאוד בקרב מפתחים רבים בתחום פיתוח Web, והיא חופשית לשימוש ללא דמי תשלום.",
                "את תוכנת עריכת הקוד VS-Code ניתן להוריד מהאתר הרשמי שלה. ישנן מספר גרסאות של התוכנה שמותאמות למערכות הפעלה. הקורס הזה מותאם למערכת הפעלה Windows, אבל בהחלט אפשר ללמוד בקורס גם עם מערכות הפעלה שונות ולעשות את ההתאמות הדרושות."
              ],
              "BigButton": {
                "urlLink": "https://code.visualstudio.com/",
                "text": "Virtual Studio Code - Code Editor"
              }
            },
            {
              "textBlock": [
                "לאחר ההורדה וההתקנה של עורך הקוד במחשב אנחנו נדרשים לעוד שני כלי עבודה חשובים שיהפכו לנו את החיים כמתכנתים לקלים יותר. הראשון הוא כמובן דפדפן (Browser) בדיוק כמו שהשתמשנו בשיעורים הקודמים כדי לראות איך יצאה הכתבה הדיגיטלית שיצרנו. ההמלצה היא להשתמש לפחות בשני דפדפנים שונים, בין הדפדפנים הפופולריים, כדי לראות שהאתר שאנחנו בונים נראה כפי שאנחנו רוצים. הדפדפנים הפופולריים והנפוצים שמומלץ להשתמש בהם הם Google Chrome, Microsoft Edge ו-Firefox.",
                "כמו כן, כלי נוסף וחשוב שכדאי להתקין מתוך תוכנת VS-Code הוא כלי ה-Live Server. כלי זה הוא למעשה תוכנת הרחבה שנמצאת בתוך ה-VS-Code, וכדי להתקין אותה אנחנו צריכים לגשת לספריית ההרחבות (Extentions) שנמצאת בסרגל שבצד שמאל של חלון התוכנה, לכתוב בשורת החיפוש Live Server ולבצע התקנה."
              ],
              "BigButton": {
                "urlLink": "https://marketplace.visualstudio.com/items?itemName=ritwickdey.LiveServer",
                "text": "Live Server Extention"
              }
            },
            {
              "textBlock": [
                "לאחר שהורדנו והתקנו את עורך הקוד (Code Editor), דאגנו שיש לנו דפדפן (Browser), ווידאנו שההרחבה Live Server מותקנת בעורך הקוד, אנחנו יכולים בחלון הקוד על הלחצן הימני של העכבר ולבחור באפשרות Open with Live Server. מיד נוכל לראות שחלון של דפדפן ברירת המחדל שהגדרנו יפתח ויציג לנו את התוצאה של הקוד שכתבנו בקובץ ה-HTML."
              ]
            }
          ]
        },
        {
          "lessonId": "1.4",
          "title": "סביבות עבודה: Git & GitHub",
          "sections": [{ "sectionTitle": "Git" }, { "sectionTitle": "GitHub" }]
        }
      ]
    },
    {
      "module": 2,
      "title": "HTML",
      "lessons": [
        {
          "lessonId": "2.1",
          "title": "המבנה האנטומי של עמוד HTML",
          "sections": [
            {
              "sectionTitle": "מה זה HTML?",
              "textBlock": [
                "HTML ,ראשי תיבות של HyperText Markup Language, זו למעשה שפת תגיות שעל בסיסה כל אתרי האינטרנט בנויים. מסמך HTML קובע את המבנה של עמוד אינטרנט ואת המשמעויות של התכנים והרכיבים שנמצאים בעמוד האינטרנט. משמעות המונח HyperText בראשי התיבות מתייחסת לקשרים שבין דפי אינטרנט שונים, ובכלל זאת גם בין אתרי אינטרנט. כלומר ברגע שאנחנו מעלים תוכן ויוצרים דף אינטרנט, אנחנו הופכים באותו רגע למשתתפים פעילים ב-World Wide Web - רשת האינטרנט הגדולה.",
                "המונח Markup שבראשי התיבות מתייחס לתגיות שמגדירות כל סוג של תוכן שמופיע בעמוד האינטרנט למשל תכנים מילוליים מוגדרים על-ידי תגיות מסוימות, תכנים חזותיים מוגדרים על-ידי תגיות אחרות. ויש גם תגיות שמגדירות אזורים מסויימים בתוך העמוד בעלי מאפיינים שונים ויחודיים. כמו כן, יש תגיות שבהגדרה שלהן מתייחסות לתוכן שמוצג בדפדפן, ותגיות אחרות שמציינות פרטים טכניים על האתר ונשארות מאחורי הקלעים. בפרק הזה של הקורס אנחנו נלמד על כל התגיות הבסיסיות ועל התפקידים היחודיים של כל אחת.",
                "כל רכיב שאנחנו רוצים לשים בעמוד אינטרנט שאנחנו יוצרים צריך להיות תחום בין תגית פתיחה לתגית סגירה. לדוגמא, אם אנחנו רוצים להוסיף את המשפט \"כי האדם עץ השדה\" אנחנו נעטוף את המשפט הזה בתג פסקה פותח ובתג פסקה סוגר."
              ],
              "codeBox": {
                "lines": [
                  {
                    "element": "<p>כי האדם עץ השדה</p>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "codeLang": "HTML"
              }
            },
            {
              "sectionTitle": "המבנה האנטומי של מסמך HTML",
              "textBlock": [
                "לכל עמוד אינטרנט יש מבנה בסיסי אחיד וקבוע. ראשית כל, המסמך תחום כולו בתגי <html> אשר בין התג הפותח לתג הסוגר אנחנו נכתוב את כל הקוד של העמוד. בין התגים האלה יופיעו תמיד עוד שני סוגים של תגים - תג <head> ותג <body>."
              ],
              "codeBox": {
                "lines": [
                  {
                    "element": "<!DOCTYPE html>",
                    "spaces": 0,
                    "color": "yellow.300"
                  },
                  { "element": "<html>", "spaces": 0, "color": "red.300" },
                  { "element": "<head>", "spaces": 2, "color": "blue.300" },
                  {
                    "element": "<meta charset=\"UTF-8\" />",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<title>Document</title>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<style></style>",
                    "spaces": 4,
                    "color": "white"
                  },
                  { "element": "</head>", "spaces": 2, "color": "blue.300" },
                  { "element": "<body>", "spaces": 2, "color": "green.300" },
                  { "element": "", "spaces": 2, "color": "white" },
                  { "element": "</body>", "spaces": 2, "color": "green.300" },
                  { "element": "</html>", "spaces": 0, "color": "red.300" }
                ],
                "codeLang": "HTML"
              }
            },
            {
              "sectionTitle": "תגיות <html></html>",
              "textBlock": [
                "כדי להגדיר מסמך כמסמך אינטרנט, התגיות הראשונות שאנחנו חייבים לציין הן תגיות <html> כתגית פותחת בתחילת המסמך, ותגית <html/> כתגית סוגרת בסוף המסמך. התגיות האלה מגדירות את המסמך הממשי, ובינהן יבוא כל התוכן של העמוד.",
                "כמו כן, בנוסף לצמד התגיות האלה, בכל מסמך HTML חייב גם להיות ציון בראש המסמך על-ידי התגית <DOCTYPE html!> אשר מציינת את גרסת ה-HTML שבה נעשה שימוש במסמך. בגרסת HTML5 משתמשים בתגית זו. בהמשך הקורס נלמד יותר לעומק על השינוי שגרסת HTML5 הביאה לעולם פיתוח האתרים, ועל היתרונות הרבים שלה."
              ]
            },
            {
              "sectionTitle": "תגיות <head></head>",
              "textBlock": [
                "בין צמד התגיות האלה יופיעו כל הפרטים על דף האינטרנט אשר לא אינם מוצגים על המסך. כלומר כל אותם פרטים שהדפדפנים משתמשים בהם כדי להבין את סוג העמוד והתוכן שבו. לדוגמא, פרטים כמו שיטת קידוד המלל, תצוגת מסך אופטימלית של האתר, עיצוב וסגנון ועוד דברים שנלמד בהמשך הקורס..",
                "בין תגים אלה אנחנו גם תמיד נמצא את צמד תגי <title></title> שמציינים את כותרת העמוד, אשר תופיע בכותרת חלון הדפדפן של אותו עמוד."
              ]
            },
            {
              "sectionTitle": "תגיות <body></body>",
              "textBlock": [
                "בין צמד התגיות האלה נמצא את הרכיבים החזותיים שמוצגים בעמוד בדפדפן האינטרנט. כלומר על קטעי המלל, תמונות, גרפים, טפסים, קישורים וכפתורים ועוד רכיבים רבים שאנחנו בוחרים להציב בתוך העמוד שאנחנו בונים."
              ]
            }
          ]
        },
        {
          "lessonId": "2.2",
          "title": "רכיבים מילוליים: כותרות, פסקאות ורשימות (Headings, Paragraphs & Lists)",
          "sections": [
            {
              "sectionTitle": "סוגי טקסטים",
              "textBlock": [
                "מילים מהוות חלק עיקרי ומשמעותי מאוד בכל אתר אינטרנט. אבל אם כל התוכן המילולי יהיה אחיד וזהה חווית המשתמש עלולה להיפגע מאוד, ואף ההתמצאות באתר עלולה להפוך למשימה מסורבלת ומעיקה. ",
                "עוד הרבה לפני שהאינטרנט נכנס לחיינו, ואיתו המדיה הדיגיטלית, התקשורת התבססה בעיקר על עיתונים מודפסים. בעיתון \"דבר\", מספטמבר 1929, שמובא כאן כדוגמא אנחנו יכולים לראות את ההבדלים הטקסטואליים. אנחנו יכולים לראות שישנן כותרות, פסקאות, הערות שוליים וקרדיטים. סוגי הטקסטים השונים נבדלים זה מזה במאפיינים שונים, בעיקר בגודל האותיות, והם למעשה מה שעוזר לקורא להתמצא בצורה טובה יותר בעיתון, להבין איפה מתחילה כתבה, והיכן היא מסתיימת, לזהות את נושא הכתבה ולהחליט אם היא מספיק מעניינת אותו כדי להמשיך לקרוא."
              ],
              "image": {
                "url": "/images/lessonsContents/module2/lesson2/article_davar_6-9-1929.png",
                "altText": "עיתון דבר, 1929",
                "imageSubject": "",
                "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"דבר\", 6 בספטמבר 1929.",
                "width": [300, 400]
              }
            },
            {
              "textBlock": [
                "באותו אופן גם המדיה הדיגיטלית עובדת. גם כשאנחנו מתכננים עמוד אינטרנט, אנחנו נדאג שיהיו בו כותרות, חלוקה לפסקאות, הערות שוליים אם צריך, קרדיטים וכיוצא באלה. אם אנחנו עובדים עם טקסט ארוך כמו פרסום בבלוג, פוסט או כתבה, אז גם נדאג לעשות ריווח בין השורות ובין הפסקאות. הכל על מנת לאפשר נוחות מירבית למשתמשים באתר שלנו.",
                "כמו שכבר למדנו בשיעור הקודם במבנה הבסיסי של מסמך HTML, טקסטים הם רכיב שאנחנו רוצים להציג למשתמש. לכן כל התגיות האלה יתווספו בין תגי ה-<body>. "
              ]
            },
            {
              "sectionTitle": "כותרות - Headings",
              "textBlock": [
                "עומדות לרשותנו שישה סוגי כותרות שאנחנו יכולים להשתמש בהן בתוך המסמך. התג שמגדיר כותרת מכיל את האות \"h\" וספרה בין 1 ל-6. כאשר <h1> היא כותרת ראשית, והכותרות הבאות הן תתי-כותרות ברמה חשיבות שהולכת וקטנה.",
                "בנוסף לזאת, כותרות הן מה שנקרא רכיב block-level, כלומר רכיב שכברירת מחדל מופיע בעמוד בשורה חדשה ותופס את כל רוחב השורה. אך דבר אינו גזירת גורל, שכן אנחנו יכולים לשנות תכונות שונות של הכותרת באמצעות מאפיינים עיצוביים, שנלמד להם מעט ביחידה זו של הקורס, ובהרחבה ביחידה הבאה.",
                "הרמות השונות של הכותרות לא רק נבדלות בגודל של הטקסט, אלא יש להן גם משמעות סמנטית. כאשר הדפדפן קורא את מסמך ה-HTML כדי להציגו על המסך הוא יודע לזהות את סוגי הכותרות האלה. גם מנועי החיפוש משתמשים בסמנטיקה של הכותרות כדי להבין את תוכן האתר ולהציג תוצאות רלוונטיות. חשוב באותה מידה, גם קוראי מסך (Screen Reader), שאנשים עם עיוורון או עם לקות ראייה משתמשים בהם, מתייחסים לסמנטיקה של הכותרות כדי לנווט בעמוד בצורה יעילה וברורה.",
                "כדי לנצל את היכולות של מנועי החיפוש, וגם כדי לא לבלבל את קוראי המסך (Screen Readers) נהוג להשתמש פעם אחת בלבד בכל עמוד בכותרת הראשית <h1>. בדרך כלל נשתמש בה עבור כותרת האתר כולו. חשוב גם לשמור על שימוש בכותרות לפי סדר המספרים, בלי לדלג על דרגות. כלומר אם לא השתמשנו בעמוד בכותרת <h3>, אז לא נשתמש בכותרת <h4>."
              ],
              "codeBox": {
                "lines": [
                  { "element": "<body>", "spaces": 0, "color": "white" },
                  {
                    "element": "<h1>Main heading</h1>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<h2>Subheading</h2>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<h3>Sub-subheading</h3>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<h4>Header 4</h4>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<h5>Header 5</h5>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<h6>Header 6</h6>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  { "element": "</body>", "spaces": 0, "color": "white" }
                ],
                "codeLang": "HTML",
                "outputCode": [
                  {
                    "type": "h1",
                    "content": "Main heading",
                    "style": {
                      "display": "block",
                      "fontSize": "2em",
                      "marginTop": "0.67em",
                      "marginBottom": "0.67em",
                      "marginLeft": "0",
                      "marginRight": "0",
                      "fontWeight": "bold"
                    }
                  },
                  {
                    "type": "h2",
                    "content": "Subheading",
                    "style": {
                      "display": "block",
                      "fontSize": "1.5em",
                      "marginTop": "0.83em",
                      "marginBottom": "0.83em",
                      "marginLeft": "0",
                      "marginRight": "0",
                      "fontWeight": "bold"
                    }
                  },
                  {
                    "type": "h3",
                    "content": "Sub-subheading",
                    "style": {
                      "display": "block",
                      "fontSize": "1.17em",
                      "marginTop": "1em",
                      "marginBottom": "1em",
                      "marginLeft": "0",
                      "marginRight": "0",
                      "fontWeight": "bold"
                    }
                  },
                  {
                    "type": "h4",
                    "content": "Heading 4",
                    "style": {
                      "display": "block",
                      "fontSize": "1em",
                      "marginTop": "1.33em",
                      "marginBottom": "1em",
                      "marginLeft": "0",
                      "marginRight": "0",
                      "fontWeight": "bold"
                    }
                  },
                  {
                    "type": "h5",
                    "content": "Heading 5",
                    "style": {
                      "display": "block",
                      "fontSize": "0.83em",
                      "marginTop": "1.67em",
                      "marginBottom": "1.67em",
                      "marginLeft": "0",
                      "marginRight": "0",
                      "fontWeight": "bold"
                    }
                  },
                  {
                    "type": "h6",
                    "content": "Heading 6",
                    "style": {
                      "display": "block",
                      "fontSize": "0.67em",
                      "marginTop": "1.67em",
                      "marginBottom": "1.67em",
                      "marginLeft": "0",
                      "marginRight": "0",
                      "fontWeight": "bold"
                    }
                  }
                ]
              }
            },
            {
              "sectionTitle": "פסקה - Paragraph",
              "textBlock": [
                "כמו בעיתון מודפס, גם בעמוד אינטרנט אנחנו משתשמים פעמים רבות בתוכן מילולי. לצורך כך יש לרשותנו כמה רכיבי תוכן מילולי שלכל אחד יש תכונות ייחודיות."
              ],
              "listBlock": [
                "<p></p> - פסקה רגילה.",
                "<pre></pre> - פסקה מרובת שורות.",
                "<span></span> - תוכן מילולי מוחרג"
              ]
            },
            {
              "textBlock": [
                "בדומה לכותרות, גם פסקה היא רכיב block-level אשר תופס את כל רוחב המסך האפשרי. כמו כן, כל התוכן של הפסקה שיופיע בין תגית הפתיחה לתגית הסגירה גם הוא יישאף למלא את כל רוחב המסך ויירד  שורה רק כאשר התוכן מגיע לקצה רוחב המסך.",
                "סוג נוסף של תגית ליצירת פסקה אלה צמד התגיות <pre></pre>, אשר בין תגיות אלה אנחנו יכולים להכניס מלל עם שבירת שורות. כלומר נוכל להשתמש בסוג זה של פסקה כשאנחנו רוצים לשמור על תוכן מילולי עם שורות קצרות, כמו שיר לדוגמא.",
                "אם אנחנו רוצים להתייחס לקטע מסוים בתוך פסקה באופן שונה משאר הפסקה, לדוגמא להדגיש מילה אחת או כמה מילים, בהבלטה, בצבע שונה, בהטיית המלל, בקו תחתון, או כל סוג אחר של הדגשה שמחריג את המילים האלו משאר התוכן של הפסקה, אז אנחנו נשתמש בתגית span. תגית זו היא רכיב מסוג inline, שבשונה מהשתיים הקודמות זו תגית שכברירת מחדל אינה מתחילה שורה חדשה, והיא משתדלת, עד כמה שאפשר להשתלב בתוך שורה קיימת.",
                "אנחנו יכולים גם להוסיף תכונות עיצוב לרכיבי המלל השונים (ולרכיבי HTML בכלל). נעשה את זה פשוט על-ידי הוספת התכונה style בתוך תגית הפתיחה ונקבע איזה מאפיין ייחודי של עיצוב אנחנו רוצים להציג. בבלוק הקוד הבא אפשר לראות את השימוש בסוגי התגיות של פסקאות ואת השימוש בעיצוב, אך ביחידה הבאה של הקורס נעסוק בעיצוב העמוד בצורה יותר מעמיקה. כרגע בעזרת הוספת העיצוב אפשר לראות את ההבלטה המיוחדת של חלק מהמלל, ואת המשמעות של ההבדלים בין רכיב inline לרכיב block-level."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body direction=\"rtl\">",
                    "spaces": 0,
                    "color": "white"
                  },
                  { "element": "<p>", "spaces": 2, "color": "yellow.300" },
                  {
                    "element": "אספת עם גדולה שהשתתפו בה",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "<span style='font-weight: bold'>ארבעים אלף יהודים</span>",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "קבלה החלטה הדורשת מאת בריטניה כי עליה להצהיר מחדש את רצונה להגשים את הצהרת בלפור.",
                    "spaces": 4,
                    "color": "white"
                  },
                  { "element": "</p>", "spaces": 2, "color": "yellow.300" },
                  {
                    "element": "<pre style='background-color: lightgoldenrodyellow'>",
                    "spaces": 2,
                    "color": "yellow.300"
                  },
                  {
                    "element": "אספת עם גדולה שהשתתפו בה ארבעים אלף יהודים,",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "קבלה החלטה הדורשת מאת בריטניה,",
                    "spaces": 4,
                    "color": "white"
                  },
                  {
                    "element": "כי עליה להצהיר מחדש את רצונה להגשים את הצהרת בלפור",
                    "spaces": 4,
                    "color": "white"
                  },
                  { "element": "</pre>", "spaces": 2, "color": "yellow.300" },
                  { "element": "</body>", "spaces": 0, "color": "white" }
                ],
                "outputCode": [
                  {
                    "type": "p",
                    "content": [
                      {
                        "type": "span",
                        "content": "אספת עם גדולה שהשתתפו בה ",
                        "style": {}
                      },
                      {
                        "type": "span",
                        "content": "ארבעים אלף יהודים",
                        "style": {
                          "fontWeight": "bold"
                        }
                      },
                      {
                        "type": "span",
                        "content": ",\n קבלה החלטה הדורשת מאת בריטניה,\n כי עליה להצהיר מחדש את רצונה להגשים את הצהרת בלפור",
                        "style": {}
                      }
                    ],
                    "style": {
                      "marginTop": "1em",
                      "marginBottom": "1em",
                      "marginLeft": "0",
                      "marginRight": "0",
                      "direction": "rtl"
                    }
                  },
                  {
                    "type": "pre",
                    "content": "אספת עם גדולה שהשתתפו בה ארבעים אלף יהודים,\nקבלה החלטה הדורשת מאת בריטניה,\nכי עליה להצהיר מחדש את רצונה להגשים את הצהרת בלפור",
                    "style": {
                      "display": "block",
                      "fontFamily": "monospace",
                      "margin": "1em 0",
                      "whiteSpace": "pre",
                      "backgroundColor": "lightgoldenrodyellow",
                      "direction": "rtl"
                    }
                  }
                ]
              }
            },
            {
              "frameClause": {
                "frameTitle": "עברית ואנגלית באינטרנט",
                "paragraphs": [
                  "דבר חשוב נוסף שכדאי להכיר הוא כיוון הכתיבה. כידוע ישנן שפות שנכתבות משמאל לימין, כמו אנגלית, ואחרות שנכתבות מימין לשמאל, כמו עברית. ברירת המחדל של מסמך HTML היא כיוון כתיבה משמאל לימין. לכן, אם ברצוננו לבנות אתר בשפה העברית עלינו להגדיר את כיוון הכתיבה לכל האתר. כדי לעשות זאת אנחנו יכולים להוסיף תכונה (Attribute) בתוך תג הפתיחה של ה-body עם הערך 'RTL' שמשמעותו Right To Left. באופן דומה אפשר גם להגדיר 'LTR', אבל זה כאמור ברירת המחדל."
                ]
              }
            },
            {
              "sectionTitle": "רשימות - Lists",
              "textBlock": [
                "כשעסקנו קודם בכותרות ופסקאות למדנו שיש צמד תגיות, פתיחה וסגירה, ובינהן התוכן שאנחנו רוצים להציג. אך ישנם רכיבים שלא מכילים בהכרח תוכן מילולי, אלא הם מכילים בתוך עצמם רכיבים אחרים. בדיוק כמו שאת הכותרות והפסקאות הכנסו לתוך תגי ה-<body>. רשימות הן סוג כזה של רכיבים, ואנחנו קוראים להם רכיבים מקוננים - Nested elements.",
                "למעשה רשימות נחלקות לשני סוגים עיקריים. סוג אחד הוא רשימה של פריטים בדידים, כלומר שאין חשיבות לסדר של הפריטים (Unorder list). כמו לדוגמא רשימת מכולת. בשביל להגדיר אותה במסמך HTML אנחנו נשתמש בתגי האם <ul></ul> ובינהם נכניס את תגי הפריטים עצמם <li></li>, כאשר בינהם נרשום את התוכן המילולי שאנחנו רוצים להציג על המסך."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  { "element": "<body>", "spaces": 0, "color": "white" },
                  { "element": "<ul>", "spaces": 2, "color": "red.300" },
                  {
                    "element": "<li>Strawberry</li>",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<li>Orange</li>",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<li>Apple</li>",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  { "element": "</ul>", "spaces": 2, "color": "red.300" },
                  { "element": "</body>", "spaces": 0, "color": "white" }
                ],
                "outputCode": [
                  {
                    "type": "ul",
                    "content": [
                      {
                        "type": "li",
                        "content": "Strawberry",
                        "style": {
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0"
                        }
                      },
                      {
                        "type": "li",
                        "content": "Orange",
                        "style": {
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0"
                        }
                      },
                      {
                        "type": "li",
                        "content": "Apple",
                        "style": {
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0"
                        }
                      }
                    ],
                    "style": {
                      "listStyleType": "disc",
                      "paddingLeft": "40px"
                    }
                  }
                ]
              }
            },
            {
              "textBlock": [
                "הסוג השני שנכיר היא רשימה מסוג סדר, כלומר רשימה שבה לפריטים יש חשיבות היררכית או חשיבות של סדר מסוים בין הפריטים (Order list). את הרשימה הזאת אנחנו נגדיר באמצעות תגי האם <ol></ol>, וכמו בסוג הקודם של רשימה בינהם נוסיף את תגי הבן <li></li> ובתוכם את המלל שנרצה להוסיף ולהציג על הדפדפן."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body dir='rtl'>",
                    "spaces": 0,
                    "color": "white"
                  },
                  { "element": "<ol>", "spaces": 2, "color": "red.300" },
                  {
                    "element": "<li>סבא</li>",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<li>אבא</li>",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<li>ילד</li>",
                    "spaces": 4,
                    "color": "yellow.300"
                  },
                  { "element": "</ol>", "spaces": 2, "color": "red.300" },
                  { "element": "</body>", "spaces": 0, "color": "white" }
                ],
                "outputCode": [
                  {
                    "type": "ol",
                    "content": [
                      {
                        "type": "li",
                        "content": "סבא",
                        "style": {
                          "display": "list-item",
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0"
                        }
                      },
                      {
                        "type": "li",
                        "content": "אבא",
                        "style": {
                          "display": "list-item",
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0"
                        }
                      },
                      {
                        "type": "li",
                        "content": "ילד",
                        "style": {
                          "display": "list-item",
                          "marginTop": "1em",
                          "marginBottom": "1em",
                          "marginLeft": "0",
                          "marginRight": "0"
                        }
                      }
                    ],
                    "style": {
                      "listStyleType": "decimal",
                      "paddingRight": "40px",
                      "direction": "rtl"
                    }
                  }
                ]
              },
              "decorativeLine": true
            },
            {
              "sectionTitle": "זמן תרגול",
              "textBlock": [
                "אחרי שלמדנו את המבנה הבסיסי, השלד של כל עמוד אינטרנט באשר הוא, בשיעור הראשון. עשינו גם היכרות עם רכיבי מלל עיקריים בשיעור השני, הגיע העת לתרגל את מה שלמדנו.",
                "אז לצורך התרגול הראשון הכינו לעצמכם תיקייה ייעודית במחשב שתשמש אתכם לכתיבת כל התרגולים לאורך הקורס הזה. בתוך התיקייה צרו תיקיות משנה לכל יחידת לימוד, ופעלו לפי הנחיות התרגילים. את הקוד לצורך התרגילים הראשונים כיתבו בקובץ Notepad פשוט ושמרו אותו בתיקייה שיצרתם."
              ],
              "listBlock": [
                "ראשית בתוך תיקיית השיעור שיצרתם צרו קובץ טקסט חדש עם סיומת 'txt.'",
                "שנו את הסיומת של הקובץ שנוצר לסיומת 'html.' (כדי שהדפדפן יידע לקרוא את הקוד ולפענח אותו).",
                "כתבו קוד HTML בתוך הקובץ שיצרתם ושמרו אותו.",
                "פתחו את הדפדפן המועדף עליכם והזינו בשורת הכתובת את הנתיב (path) לקובץ שזה עתה יצרתם. "
              ]
            },
            {
              "sectionTitle": "תרגיל - עיתונות דיגיטלית",
              "textBlock": [
                "בתרגיל הראשון אתם מתבקשים לבחור כתבה מעיתון יומי מודפס ולהפוך אותה לדיגיטלית. אתם יכולים לבחור כתבה אחת מתוך האפשרויות שמוצעות כאן למטה, או לבחור כתבה אחרת קצרה שמצאתם בעיתון יומי.",
                "שימו לב למבנה הכתבה ולשימוש בכותרות, פסקאות ורשימות (אם קיימות). דאגו להשתמש בכל מה שלמדתם עד עכשיו, בשיעור הראשון על מבנה מסמך HTML, וכל מה שלמדתם בשיעור השני על סוגי טקסטים. התאימו את הרכיבים השונים למה שאתם מוצאים בכתבה שבחרתם."
              ],
              "imagesGallery": [
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/article_davar_6-9-1929.png",
                  "altText": "עיתון דבר, 6.9.1929",
                  "imageSubject": "מבזקי חדשות קצרים לאחר מאורעות תרפ\"ט. מתוך עיתון \"דבר\".",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"דבר\", 6 בספטמבר 1929."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/article_davar_30-11-1947.png",
                  "altText": "כתבה מעיתון \"דבר\", 30.11.1947. הודעת דוד בן גוריון לאחר הצבעת החלוקה באו\"ם.",
                  "imageSubject": "דברי ראש הממשלה, דוד בן גוריון לאחר החלטת החלוקה של האו\"ם.",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"דבר\", תאריך:  30 בנובמבר 1947."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/article_palestinepost_30-11-1947.png",
                  "altText": "Article form Palstine Post, November 30th, 1947",
                  "imageSubject": "החגיגות של היהודים לאחר החלטת החלוקה של האו\"ם.",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"PALSTINE POST\", תאריך:  30 בנובמבר 1947."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/article_palestinepost_14-05-1948.png",
                  "altText": "Article from Palstine Post, May 14th, 1948.",
                  "imageSubject": "השידור הראשון של תחנת הרדיו \"קול ישראל\".",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"PALSTINE POST\", תאריך:  14 במאי 1948."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/article_haretz_17-5-1948.png",
                  "altText": "כתבה מעיתון \"הארץ\", 16.5.1948. מכירת בולים על ידי דואר ישראל.",
                  "imageSubject": "מכירת בולים ראשונים שהונפקו על-ידי דואר ישראל.",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"הארץ\", תאריך:  16 במאי 1948."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/davar_11-06-1948_army.png",
                  "altText": "כתבה מעיתון \"דבר\" על צבא ההגנה לישראל. 11.6.1948.",
                  "imageSubject": "מודעת בקשת תרומות לצבא ההגנה לישראל שמוקם ומתגבש בימיו הראשונים.",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"דבר\", 11 ביוני 1948."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/haaretz_21-05-1948_transportation-in-war.png",
                  "altText": "כתבה מעיתון \"הארץ\" על הוראות בדבר האפלת אורות הרכבים בזמן המלחמה. 21.5.1948.",
                  "imageSubject": "מודעה בעיתון הארץ עם הוראות מדויקות כיצד לעשות האפלה לפנסי הרכבים בזמן מלחמה.",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"הארץ\", 21 במאי 1948."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/haaretz_12-04-1961_eichman.png",
                  "altText": "כתבה מעיתון \"הארץ\" על משפט אייכמן. 12.4.1961.",
                  "imageSubject": "כתבה בעיתון \"הארץ\" על הבאתו של הצורר הנאצי אדולף אייכמן למשפט בישראל.",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"הארץ\", 12 באפריל 1961."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson2/davar_20-11-1977_sadat-visit-israel.png",
                  "altText": "כתבה מעיתון \"דבר\" כתבה על ביקור סאדאת בישראל. 20.11.1977.",
                  "imageSubject": "כתבה בעיתון \"דבר\" על ביקור נשיא מצרים אנואר סאדאת בישראל ונאומו בכנסת.",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"דבר\", 20 בנובמבר 1977."
                }
              ]
            }
          ]
        },
        {
          "lessonId": "2.3",
          "title": "חיבורים בין עולמות וקישורים (Links)",
          "sections": [
            {
              "sectionTitle": "חיבורים בין עולמות",
              "textBlock": [
                "בשיעור הקודם עסקנו בסוגים השונים של מלל, ואפילו יצרנו עמוד אינטרנט פשוט שחידשנו בו כתבה מהעבר. אבל האינטרנט מאפשר לנו הרבה יותר מזה. בשונה מהעיתונות המודפסת, באתר אינטרנט אנחנו יכולים לחבר ביתר קלות בין רעיונות שונים, מקורות מידע, דפים ואפילו אנשים.",
                "אז רגע לפני שנצלול לעומק השיעור, בואו נשחק משחק קטן עם קישורים, ונבדוק אילו חיבורים אנחנו יכולים לעשות במרחב האינטרנט."
              ],
              "frameClause": {
                "frameTitle": "משחק - מירוץ ויקיפדיה",
                "paragraphs": [
                  "מטרת המשחק להגיע מערך אחד לאחר בדרך הקצרה ביותר.",
                  "איך משחקים? מתחילים מערך אחד  שקובעים מראש, מגדירים ערך יעד שאליו רוצים להגיע בסוף, ומתחילים לחפש דרך הקישורים שמופיעים בכל ערך את הדרך לערך היעד שהוגדר מראש.",
                  "המנצח הוא זה שהגיע לערך היעד בדרך הכי קצרה (עם הכי פחות הקלקות).",
                  "ערכים שאפשר לבחור: תל-אביב - מדריד, נועה קירל - דוד בן גוריון, ליונל מסי - ערן זהבי ועוד כיד הדמיון הטובה."
                ]
              }
            },
            {
              "textBlock": [
                "אנחנו יכולים לקשר בין אזורים שונים בתוך העמוד שבו אנחנו צופים, לקשר בין עמודים שונים באתר שלנו, ואפילו לקשר בין אתרים שונים לחלוטין. למעשה, אם נחזור לדוגמא של העיתון, היכולת לקשר בין אלמנטים שונים, הופכת את האינטרנט למרחב ענק של ידע,עם אפשרויות כמעט בלתי מוגבלות.",
                "אז איך מוסיפים קישורים למסמך HTML שאנחנו בונים? פשוט מאוד, כמו לכל רכיב, גם לקישור יש תגיות משלו."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<a>HyperLink</a>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": []
              }
            },
            {
              "textBlock": [
                "אבל התגיות האלה לא מספיקות עדיין כדי שהקישור באמת יעבוד, אנחנו צריכים להגדיר בדיוק מה אנחנו רוצים שהקישור הייחודי הזה יעשה. מה הכוונה \"ייחודי\"? הכוונה היא שגם אם אנחנו רוצים להשתמש בכמה קישורים באתר שלנו, אנחנו לא רוצים שכל הקישורים יקשרו בדיוק לאותו יעד. לכל קישור יש את התפקיד שלו - או במילים אחרות, לכל קישור יש התכונות (Attributes) שלו.",
                "אז אילו תכונות יכולות להיות לקישור? בראש ובראשונה - יעד. הכי חשוב, לאן אנחנו רוצים שהקישור ינווט. קישור יכול לנווט למגוון של יעדים. כאמור, לדפי אינטרנט אחרים או לחלק אחר באותו עמוד, אבל קישור יכול גם לנווט להורדת קובץ, לשליחת דואר אלקטרוני, למספר טלפון ולעוד סוגים שונים של יעדים.",
                "אז כדי להגדיר לקישור את תכונת היעד אנחנו נוסיף בתוך התגית הפותחת את התכונה href, שזה למעשה קיצור של hyperlink reference, באופן הבא:"
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<a href=\"\">Go to Google</a>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "a",
                    "content": "Go to Google",
                    "style": {
                      "color": "blue",
                      "textDecoration": "underline",
                      "cursor": "pointer"
                    }
                  }
                ]
              }
            },
            {
              "sectionTitle": "נתיב מלא ונתיב יחסי",
              "textBlock": [
                "כשאנחנו מציינים את הנתיב שאליו אנחנו רוצים שהקישור יוביל, אנו יכולים לעשות את זה באחת משתי דרכים עיקריות."
              ],
              "listBlock": [
                "ניתוב מלא מתייחס לדרך המפורטת ביותר אל הפריט שאנחנו רוצים להוביל אליו. בניתוב מלא נשתמש לרוב כשאנחנו רוצים לנווט לעמודים שנמצאים מחוץ לאתר שלנו.",
                "ניתוב יחסי מציין את המיקום היחסי של היעד שאנחנו רוצים להגיע אליו ביחס למיקום של העמוד שהקישור מופיע בו. אם נתייחס לדוגמא של מבנה התיקיות שמופיע למטה, ונרצה לקשר בין העמוד index.html שנמצא בתיקייה הראשית של הפרויקט, לעמוד about.html שנמצא בתוך התיקייה about, אז לא נצטרך לכתוב את הנתיב המלא של היעד, אלא נוכל להסתפק בנתיב היחסי באופן הבא: 'about/about.html/'."
              ],
              "codeBox": {
                "codeLang": "Files structure",
                "lines": [
                  { "element": "root", "spaces": 0, "color": "white" },
                  { "element": "index.html", "spaces": 1, "color": "white" },
                  { "element": "/about", "spaces": 1, "color": "white" },
                  { "element": "about.html", "spaces": 4, "color": "white" },
                  { "element": "/images", "spaces": 1, "color": "white" },
                  { "element": "/contact", "spaces": 1, "color": "white" }
                ]
              }
            },
            {
              "sectionTitle": "קישור פנימי וקישור חיצוני",
              "textBlock": [
                "תכונה (Attribute) נוספת שחשוב להכיר כשמגדירים קישור היא אופן הפעולה של הניווט. כלומר האם הקישור יפתח באותו חלון, בחלון חדש, בלשונית (tab) חדשה, או במסגרת מוגדרת בתוך העמוד הנצפה.",
                "את התכונה הזאת אנחנו מגדירים באמצעות התכונה target שיכולה לקבל מספר ערכים, כשהשימושיים בינהם הם אלה:"
              ],
              "listBlock": [
                "\"self_\"  - ערך ברירת המחדל של קישור. משמעותו היא שהקישור נפתח באותו עמוד שהוא הקישור נמצא. בתכונה הזאת אנחנו בדרך כלל נשתמש עבור קישורים פנימיים בתוך האתר שלנו. למשל לעמוד אחר באתר שלו או לחלק אחר בתוך העמוד. כמו כן, מכיוון שזו התנהגות ברירת המחדל של קישור, אנחנו לא חייבים להוסיף אותה.",
                "\"blank_\" - הערך הזה יגרום לקישור להיפתח בחלון חדש או בלשונית (tab) חדשה של הדפדפן. באפשרות זו אנחנו נעדיף להשתמש עבור קישורים חיצוניים, כלומר קישורים שמנווטים מחוץ לאתר שלנו, לאתרים אחרים. "
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<a href=\"https://www.google.com\" target=\"_blank\">Go to Google</a>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<a href=\"https://www.my-site.com\" target=\"_self\">About me</a>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "a",
                    "content": "Go to Google",
                    "style": {
                      "href": "",
                      "target": "_blank",
                      "color": "blue",
                      "textDecoration": "underline",
                      "cursor": "pointer"
                    }
                  },
                  {
                    "type": "a",
                    "content": "About me",
                    "style": {
                      "href": "",
                      "target": "_self",
                      "color": "blue",
                      "textDecoration": "underline",
                      "cursor": "pointer"
                    }
                  }
                ]
              }
            },
            {
              "sectionTitle": "קישורים במרחב",
              "textBlock": [
                "אם פתחתם את תצוגת הפלט של דוגמת הקוד האחרונה כאן, יכולתם בוודאי לראות ששני הקישורים שהוספנו התמקמו באותה שורה, בזה אחר זה. ההתנהגות הזו שונה מכפי שראינו בשיעור הקודם כשלמדנו על כותרות, פסקאות ורשימות. ההבדל הוא במאפיינים השונים של כל אחד מהרכיבים הללו. ישנם רכיבים שכברירת מחדל תופסים את כל רוחב הדף, מה שנקרא block (גם אם התוכן לא), ואז רכיבים אחרים שבאים אחריהם יתמקמו שורה אחת מתחתיהם. וישנם רכיבים שמתמקמים בתוך השורה, מה שנקרא inline, כלומר הם ישתלבו בתוך שורה, במידת האפשר.",
                "משום כך, ברכיבי inline אנחנו יכולים להשתמש גם בצורה עצמאית במרחב הדף, וגם בתוך רכיבים אחרים. לדוגמא לשלב קישור בתוך פסקה, רשימה, כותרת או כל רכיב אחר."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<p>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "אספת עם גדולה שהשתתפו בה ארבעים אלף יהודים, קבלה החלטה הדורשת מאת ",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "<a href=\"https://www.my-site.com\">בריטניה,</a>",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": " כי עליה להצהיר מחדש את רצונה להגשים את הצהרת בלפור.",
                    "spaces": 2,
                    "color": "white"
                  },
                  {
                    "element": "</p>",
                    "spaces": 0,
                    "color": "white"
                  }
                ],
                "outputCode": [
                  {
                    "type": "p",
                    "content": [
                      {
                        "type": "span",
                        "content": "אספת עם גדולה שהשתתפו בה ארבעים אלף יהודים, קבלה החלטה הדורשת מאת ",
                        "style": {}
                      },
                      {
                        "type": "a",
                        "content": "בריטניה,",
                        "style": {
                          "color": "blue",
                          "href": "#",
                          "textDecoration": "underline",
                          "cursor": "pointer"
                        }
                      },
                      {
                        "type": "span",
                        "content": " כי עליה להצהיר מחדש את רצונה להגשים את הצהרת בלפור.",
                        "style": {}
                      }
                    ],
                    "style": {
                      "display": "block",
                      "marginTop": "1em",
                      "marginBottom": "1em",
                      "marginLeft": "0",
                      "marginRight": "0"
                    }
                  }
                ]
              },
              "decorativeLine": true
            },
            {
              "sectionTitle": "זמן תרגול",
              "textBlock": [
                "לסיכום, הכרנו בשיעור הזה את אחת התגיות הכי חשובות ושימושיות בתהליך בניית אתר. אפשר לומר שבלי קישורים האתר יהיה דומה יותר לספר, או לעיתון. הקישורים מאפשרים לנו לנווט בקלות במרחב העמוד, האתר והאינטרנט בכלל",
                "התרגיל של השיעור הזה יהיה המשך ישיר לתרגיל הקודם. הוסיפו למאמר שבחרתם ויצרתם ממנו עותק דיגטלי קישורים בתוך הטקסט, והפכו את הכתבה שהשתמשתם לקטע בסגנון ויקיפדיה. כלומר ביחרו מילים מסוימות וקשרו בעזרתן את הטקסט שלכם למקורות נוספים ברחבי האינטרנט. ",
                "לדוגמא, אם בחרתם בטקסט כמו זה:"
              ],
              "frameClause": {
                "frameTitle": "",
                "paragraphs": [
                  "צ'רצ'יל אמר באספה אחת שנערכה בוואנקובר, קנדה, שאין כל גורם שיפריע ליהודים והערבים לחיות זה על יד זה. היהודים הביאו לא\"י עושר רב ותרבות, אף מפלגה  בריטית לא תסתלק מן ההתחייבויות כלפי התנועה הציונית בימי המלחמה."
                ]
              }
            },
            {
              "textBlock": [
                "אתם יכולים להפוך את המילה \"צ'ר'צ'יל\" לקישור ולשלוח את המשתמש לעמוד בויקיפדיה שמפרט מי הוא היה. או לבחור את המילה \"קנדה\" ולקשר אותה למקור מידע קשור כפי ראות עיניכם. אפשר גם כמובן להפוך כמה מילים ביחד לקישור אחד.",
                "מתוך הכתבה שברשותכם צרו לפחות 7 קישורים."
              ]
            }
          ]
        },
        {
          "lessonId": "2.4",
          "title": "יצירת טבלה (Tables)",
          "sections": [
            {
              "sectionTitle": "טבלאות (Tables)",
              "textBlock": [
                "בשיעורים הקודמים למדנו על סוגים שונים של הצגת תוכן מילולי בעמוד אינטרנט, ואפילו יצרנו כתבה דיגיטלית עם כותרות, פסקאות, ואולי גם השתמשנו ברשימות בכתבה שיצרנו. אבל הצורות של הן לא הצורות היחידות שאפשר להציג מילים באתר. בשיעור הקרוב נלמד איך בונים טבלה במסמך HTML, וגם נדאג כמובן שהיא תופיע בעמוד האינטרנט בדפדפן.",
                "כמו שכבר הכרנו, שפת HTML היא שפה של תגיות. לכן גם לטבלה יש את התגית שלה. בעצם, לא רק תגית אחת, אלא כדי ליצור טבלה אנחנו צריכים להכיר סט של תגיות. למעשה, לכל תכונה בטבלה יש תגית משלה. לכותרת הטבלה, לשורה בטבלה, לתא בודד, לשורת כותרות וכדומה. כל דבר כזה צריך להיות מוגדר בפני עצמו.",
                "כדי ליצור טבלה אנחנו צריכים להשתמש בתגיות מעטפת ותגיות פנימיות, כמו שלמדנו בשיעורים הקודמים על יצירת רשימה. תגיות המעטפת של טבלה הן <table></table>. תגיות בסיסיות נוספות שמרכיבות טבלה הן אלה:"
              ],
              "listBlock": [
                "<table></table> - הבלוק הראשי שמכיל את כל התוכן של הטבלה.",
                "<caption></caption> - כותרת הטבלה. התוכן שנזין בין תגים אלה יופיע בראש הטבלה.",
                "<td></td> - תא בודד בתוך הטבלה. זה הוא למעשה הרכיב הקטן ביותר בבלוק הטבלה.",
                "<tr></tr> - שורה בודדת בטבלה. בלוק זה יכיל מספר תאים.",
                "<th></th> - תא בודד של כותרת בטבלה. כלומר בתגית זו אנחנו נשתמש כשנרצה לקבוע שתא מסוים, שורת תאים או עמודת תאים, משמשים ככותרות"
              ]
            },
            {
              "textBlock": [
                "בקוד שלהלן אנחנו יכולים לראות דוגמא לטבלה עם שלוש שורות ושתי עמודות. השורה העליונה היא שורת כותרות, ועוד שתי שורות תוכן. העתיקו את את הקוד לעורך הקוד במחשבכם כדי לראות את התוצאה."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body dir='rtl'>",
                    "spaces": 0,
                    "color": "white"
                  },
                  { "element": "<table>", "spaces": 2, "color": "red.300" },
                  {
                    "element": "<caption>סוגי פירות וירקות</caption>",
                    "spaces": 4,
                    "color": "orange.300"
                  },
                  { "element": "<tr>", "spaces": 4, "color": "green.300" },
                  {
                    "element": "<th>ירקות</th>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<th>פירות</th>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  { "element": "</tr>", "spaces": 4, "color": "green.300" },
                  { "element": "<tr>", "spaces": 4, "color": "green.300" },
                  {
                    "element": "<td>גזר</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td>עגבניה</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  { "element": "</tr>", "spaces": 4, "color": "green.300" },
                  { "element": "<tr>", "spaces": 4, "color": "green.300" },
                  {
                    "element": "<td>חסה</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td>תפוז</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  { "element": "</tr>", "spaces": 4, "color": "green.300" },
                  { "element": "</table>", "spaces": 2, "color": "red.300" },
                  { "element": "</body>", "spaces": 0, "color": "white" }
                ],
                "outputCode": [
                  {
                    "type": "p",
                    "content": "Run the code in your local machine to see the result.",
                    "style": {}
                  }
                ]
              }
            },
            {
              "sectionTitle": "מיזוג תאים - colspan & rowspan",
              "textBlock": [
                "לפעמים אנחנו נרצה למזג מספר תאים לתא אחד, כך שתא מסוים בטבלה יתפוס מספר שורות או מספר עמודות. כדי לעשות את זה בקוד אנחנו צריכים להוסיף תכונה (Attribute) לתא המבוקש, ולציין את מספר השורות או העמודות שאנחנו רוצים שהוא יתפוס."
              ],
              "listBlock": [
                "colspan - נשתמש בתכונה זו עבור תא בודד מתוך הטבלה, והערך שמוזן לתכונה זו הוא מספר המציין את מספר העמודות שהתא יתפרש עליהן.",
                "rowspan - נשתמש בתכונה זו עבור תא בודד מתוך הטבלה, והערך שמוזן לתכונה זו הוא מספר המציין את מספר השורות שהתא יתפרש עליהן."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  {
                    "element": "<body dir='rtl'>",
                    "spaces": 0,
                    "color": "white"
                  },
                  {
                    "element": "<table>",
                    "spaces": 2,
                    "color": "red.300"
                  },
                  {
                    "element": "<caption>מערכת שעות שבועית</caption>",
                    "spaces": 4,
                    "color": "orange.300"
                  },
                  { "element": "<tr>", "spaces": 4, "color": "green.300" },
                  {
                    "element": "<th></th>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<th>ראשון</th>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<th>שני</th>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<th>שלישי</th>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  { "element": "</tr>", "spaces": 4, "color": "green.300" },
                  { "element": "<tr>", "spaces": 4, "color": "green.300" },
                  {
                    "element": "<td>8:00</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td>מתמטיקה</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td>אומנות</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td>חינוך גופני</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  { "element": "</tr>", "spaces": 4, "color": "green.300" },
                  { "element": "<tr>", "spaces": 4, "color": "green.300" },
                  {
                    "element": "<td>12:00</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td colspan=2>ארוחת צהריים</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td rowspan=2>אנגלית</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  { "element": "</tr>", "spaces": 4, "color": "green.300" },
                  { "element": "<tr>", "spaces": 4, "color": "green.300" },
                  {
                    "element": "<td>14:00</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td>גאוגרפיה</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  {
                    "element": "<td>היסטוריה</td>",
                    "spaces": 6,
                    "color": "yellow.300"
                  },
                  { "element": "</tr>", "spaces": 4, "color": "green.300" },
                  { "element": "</table>", "spaces": 2, "color": "red.300" },
                  { "element": "</body>", "spaces": 0, "color": "white" }
                ],
                "outputCode": [
                  {
                    "type": "p",
                    "content": "Run the code in your local machine to see the result.",
                    "style": {}
                  }
                ]
              }
            },
            {
              "sectionTitle": "סמנטיקה בתוך טבלה (Semantics Tags)",
              "textBlock": [
                "מלבד התגיות שהכרנו עתה שמאפשרות לנו ליצור טבלה במסמך HTML, ולהציגה בדפדפן, קיימות תגיות נוספות שחשוב להכיר אשר ,תפקידן הוא בעיקר לחלק את הטבלה לאזורים מוגדרים, דבר שיכול לעזור לעצב את הטבלה. נלמד יותר לעומק על עיצוב העמוד בהמשך הקורס, אך עכשיו רק נתמקד בתגיות הבאות."
              ],
              "listBlock": [
                "<thead></thead> - תג זה מציין את החלק העליון בטבלה. ברוב הפעמים התגית הזאת תעטוף את השורה הראשונה של הטבלה, שורת הכותרות.",
                "<tfoot></tfoot> - תג זה מציין את החלק התחתון בטבלה. לרוב נשתמש בתג הזה כאשר יש לנו איזו שורת סיכום או שורה תחתונה אחרת שהיא שונה משאר השורות של גוף הטבלה.",
                "<tbody></tbody> - תג זה מציין את החלק העיקרי של הטבלה. כלומר בשונה משני התגים האחרים, בתג הזה אנחנו תמיד נשתמש כדי לציין את התוכן העיקרי של כל הטבלה. "
              ],
              "decorativeLine": true
            },
            {
              "sectionTitle": "זמן תרגול - עיתונות דיגיטלית",
              "textBlock": [
                "גם בתרגיל הזה, כמו בקודמים, אנחנו נעבוד עם כתבת עיתון היסטורית ונהפוך אותה לכתבה דיגיטלית. הפעם נעשה זאת כדי לתרגל את מה שלמדנו בשיעור האחרון - יצירת טבלה.",
                "בגלריה שבתרגיל זה מוצגים מספר גזרי עיתונים מהעבר מכל מיני תחומים: תחזית מזג אוויר, לוח הצגות בתאטרון, לוח שידורים ברדיו וכדומה. בחרו קטע אחד כפי רצונכם וצרו ממנו טבלה בעזרת התגיות שלמדתם בשיעור כך שתוכלו להציגה בעמוד האינטרנט שלכם."
              ],
              "imagesGallery": [
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson4/davar_11-06-1948_radio.png",
                  "altText": "לוח שידורי רדיו, מתוך עיתון דבר, יוני 1948",
                  "imageSubject": "לוח שידורי תחנת הרדיו \"קול ישראל\" בעיתון \"דבר\".",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"דבר\", 11 ביוני 1948."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson4/davar_11-06-1948_teather.png",
                  "altText": "לוח הצגות תאטרון, מתוך עיתון דבר, יוני 1948",
                  "imageSubject": "לוח הצגות שבועי בתאטרון הקאמרי בעיתון \"דבר\".",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"דבר\", 11 ביוני 1948."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson4/davar_28-11-1947_weather.png",
                  "altText": "תחזית מזג אוויר, מתוך עיתון דבר, נובמבר 1947",
                  "imageSubject": "תחזית מזג אויר שבועית בעיתון \"דבר\".",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"דבר\", 28 בנובמבר 1947."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson4/palstinepost_28-11-1947_departures.png",
                  "altText": "לוח המראות ולוח הפלגות שפורסמו בעיתון Palestine Post.",
                  "imageSubject": "לוח המראות משדה תעופה לוד, ולוח הפלגות מנמל חיפה, שפורסמו בעיתון ה-Palstine Post, ב-28 בנובמבר 1947",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"Palstine Post\", 28 בנובמבר 1947."
                },
                {
                  "srcUrl": "/images/lessonsContents/module2/lesson4/haaretz_14-09-1952_basketball.png",
                  "altText": "טבלת ליגת הכדורסל של תל אביב מתוך עיתון הארץ.",
                  "imageSubject": "טבלת ליגת הכדורסל במדור הספורט של עיתון \"הארץ\".",
                  "descText": "מתוך אתר \"עתונות יהודית היסטורית\". הספריה הלאומית ואוניברסיטת ת\"א. עיתון \"הארץ\", 14 בספטמבר 1952."
                }
              ]
            }
          ]
        },
        {
          "lessonId": "2.5",
          "title": "אובייקטים חזותיים: תמונות ווידאו (Images & Videos)",
          "sections": [
            {
              "sectionTitle": "אובייקטים חזותיים - לא רק מילים",
              "textBlock": [
                "יש משפט שאומר שתמונה שווה אלף מילים. ואכן, פעמים רבות אנחנו יכולים למצוא בעיתונים הישנים לצד הכתבות תמונות בשחור לבן או בצבע שנותנות נקודת מבט נוספת על מה שכתוב. התמונה יכולה גם להמחיש את מה שמתואר באותה כתבה. "
              ],
              "image": {
                "url": "/images/lessonsContents/module2/lesson5/cars-sussita.jpg",
                "altText": "מכונית סוסיתא ישראלית, 1969",
                "descText": "תצלום של מכונית סוסיתא מתוך ארכיון דן הדני, האוסף הלאומי לתצלומים על שם משפחת פריצקר, הספריה הלאומית.",
                "width": [300, 400]
              }
            },
            {
              "textBlock": [
                "גם באתרי אינטרנט, סביר להניח שכבר ראיתם בעצמכם, משתמשים באופן נרחב מאוד בתמונות. כמעט לכל כתבה באתר אקטואליה, ספורט או אפילו רכילויות הכתבים דואגים לצרף תמונות בתוך הכתבות שלהם. קרוב לודאי שיצא לכם להעלות תמונה שלכם לפייסבוק או לאינסטגרם, אחרי שעברתם חוויה שרציתם לשתף עם אחרים, אולי גם צירפתם לתמונה כמה מילים על מה שחוויתם. ",
                "יתר על כן, לאתרי אינטרנט יש יתרון בולט נוסף על פני המדיה המודפסת. שכן בעמוד אינטרנט לא מוכרחים להציג רק תמונות סטטיות, מכיוון שהאינטרנט מאפשר לנו להציג קטעי וידאו קצרים (או ארוכים) ולהטמיע אותם במקומות שונים באתר. בתוך הכתבה, לצידה, או אפילו בחלק נפרד לחלוטין.",
                "אז בואו נתחיל ללמוד איך עובדים עם תמונות וקטעי וידאו בעמודי אינטרנט."
              ]
            },
            {
              "sectionTitle": "תמונות (Images)",
              "textBlock": [
                "בשונה מהתגיות שהכרנו בשיעורים הקודמים, לתמונה אין תגית פותחת ותגית סוגרת, אלא יש לה תגית אחת בלבד, והיא לא יכולה להכיל רכיבי משנה בתוכה. כמו כן, בדומה לתגית של יצירת קישור שלמדנו, גם לתגית תמונה יש תכונות (Attributes) הכרחיות לצורך הגדרתה, ועוד כמה תכונות אופציונליות.",
                "אז בואו ונכיר את התגית ואז נסביר עליה בהרחבה."
              ],
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  { "element": "<body>", "color": "white", "spaces": 0 },
                  {
                    "element": "<img src='/images/cars-sussita.jpg' alt='Sussita - Israeli car' />",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  { "element": "</body>", "color": "white", "spaces": 0 }
                ]
              }
            },
            {
              "listBlock": [
                "מקור התמונה (src, קיצור של Source) - תכונה זו מגדירה את הנתיב שממנו אנחנו רוצים להטמיע את התמונה בעמוד ה-HTML שאנחנו בונים. באופן דומה לדרך בה אנחנו מגדירים קישורים באמצעות התכונה href, גם עבור תמונה אנחנו יכולים להשתמש בנתיב המלא של התמונה, או בנתיב יחסי.",
                "טקסט חלופי (alt, קיצור של Alternate) - תכונה זו היא הכרחית בהגדרת התמונה, משתי סיבות עיקריות. הסיבה הראשונה נובעת מעניין טכני, למקרה שעלולה לקרות תקלה באתר, לדוגמא כישלון בטעינה תמונות, או טעינה איטית מדי. במקרה כזה במקום התמונה יופיע הטקסט החלופי שמוגדר באותה תגית. הסיבה השניה הנובעת מעניין של נגישות האתר. כאשר קוראי מסכים (Screen readers) ומנועי חיפוש (Search Engines) עוברים על הרכיבים הקיימים בעמוד, ויודעים לזהות את מה שמוצג בתמונות לפי הטקסט החלופי שאנחנו מגדירים."
              ]
            },
            {
              "codeBox": {
                "codeLang": "HTML",
                "lines": [
                  { "element": "<body>", "color": "white", "spaces": 0 },
                  {
                    "element": "<img",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  {
                    "element": "src='/images/cars-sussita.jpg'",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "alt='Sussita - Israeli car'",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "width='800px'",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "height='600px'",
                    "color": "yellow.300",
                    "spaces": 4
                  },
                  {
                    "element": "/>",
                    "color": "yellow.300",
                    "spaces": 2
                  },
                  { "element": "</body>", "color": "white", "spaces": 0 }
                ]
              }
            },
            {
              "listBlock": [
                "מימדי התמונה - שתי תכונות שהן אמנם לא הכרחיות, אך חשובות מאוד, הן רוחב (width) וגובה (height) התמונה. אם נוסיף תמונה למסמך ה-HTML שלנו ולא נגדיר את המימדים שאנחנו רוצים, אז התמונה תופיע כברירת המחדל בגודל המקורי שלה. לפעמים זה עלול להשתלב בצורה לא מותאמת עם תכנים אחרים בעמוד. לכן כדאי להגדיר את מימדי התמונה בעצמנו. יחד עם זאת, אנחנו לא חייבים להגדיר גם הרוחב וגם את הגובה של התמונה, אלא מספיק שנגדיר את רוחבה, והגובה ישתנה בהתאם לפרופורציה של הגודל המקורי. כמובן שאם אנחנו מחליטים להגדיר גם את הרוחב וגם את הגובה, כדאי לבדוק את הפרופורציות המקוריות של התמונה ולהגדיר את המימדים באותן פרופורציות, כדי להמנע מעיוות התמונה. "
              ],
              "frameClause": {
                "frameTitle": "אופטימיזציה (Optimization)",
                "paragraphs": [
                  "בעת שאנחנו משתמשים בתמונות באתר, חשוב להבין ולקחת בחשבון את משקל התמונה. תמונות, בשונה מתוכן מילולי עשויות להיטען לאט יותר בעמוד מה שיכול לגרום למצב שכל התוכן של העמוד נטען מהר מאוד ורק לאחר כמה שניות התמונות מופיעות.",
                  "ישנן מספר דרכים לייעל את תהליך טעינת העמוד, ולעבוד עם תמונות בצורה אופטימלית. הדרך הכי פשוטה היא להשתמש בתמונות קטנות יחסית שלא שוקלות הרבה. אבל ישנן דרכים נוספות שנלמד עליהן בהמשך הקורס ובקורסים מתקדמים יותר."
                ]
              }
            },
            {
              "sectionTitle": "קטעי וידאו (Videos)",
              "decorativeLine": "true"
            },
            {
              "sectionTitle": "זמן תרגול"
            }
          ]
        },
        {
          "lessonId": "2.6",
          "title": "יצירת טפסים (Forms)",
          "sections": [
            {
              "sectionTitle": "טפסים (Forms)"
            }
          ]
        },
        {
          "lessonId": "2.7",
          "title": "מבנה העמוד וסמנטיקה (Semantics Boxes with HTML5)",
          "sections": []
        },
        {
          "lessonId": "2.8",
          "title": "מידע על העמוד ו-Meta Data",
          "sections": []
        },
        {
          "lessonId": "2.9",
          "title": "תרגיל מסכם",
          "sections": []
        }
      ]
    },
    {
      "module": 3,
      "title": "CSS",
      "lessons": [
        {
          "lessonId": "3.1",
          "title": "מה זה CSS, ועל מה הוא אחראי בבניית אתרי אינטרנט?",
          "sections": []
        },
        {
          "lessonId": "3.2",
          "title": "הגדרות כלליות של CSS.",
          "sections": []
        },
        {
          "lessonId": "3.3",
          "title": "מאפייני עיצוב בסיסיים",
          "sections": []
        }
      ]
    },
    {
      "module": 4,
      "title": "Java Script",
      "lessons": [
        { "lessonId": "4.1", "title": "מבוא ל-Java Script", "sections": [] },
        { "lessonId": "4.2", "title": "שיעור 2", "sections": [] },
        { "lessonId": "4.3", "title": "שיעור 3", "sections": [] }
      ]
    },
    {
      "module": 5,
      "title": "פרויקט סיום",
      "lessons": [
        {
          "lessonId": "5.1",
          "title": "בחירת נושא לפרויקט",
          "sections": []
        },
        {
          "lessonId": "5.2",
          "title": "תכנון הפרויקט",
          "sections": []
        },
        {
          "lessonId": "5.3",
          "title": "ביצוע הפרויקט",
          "sections": []
        }
      ]
    },
    {
      "module": 6,
      "title": "משוב על הקורס",
      "lessons": [
        {
          "lessonId": "6.1",
          "title": "תן דעתך על הקורס",
          "sections": []
        },
        {
          "lessonId": "6.2",
          "title": "רמת הקושי של הקורס",
          "sections": []
        },
        {
          "lessonId": "6.3",
          "title": "מידת העניין בקורס",
          "sections": []
        }
      ]
    }
  ]
}
